#+TITLE: Emacs Configuration
#+AUTHOR: Isaac Zhou
#+EMAIL: isaaczhou85@gmail.com
#+OPTIONS: toc:nil num:nil

** Org Babel

#+begin_src emacs-lisp
  (use-package ob-ipython
    :ensure t)
  (require 'ob-js)
  (setq org-babel-python-command "/home/cosmos/anaconda3/bin/python3")
  (setq py-python-command "/home/cosmos/anaconda3/bin/python3")

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)
     (ipython . t)
     (C . t)
     (calc . t)
     (latex . t)
     (java . t)
     (ruby . t)
     (lisp . t)
     (scheme . t)
     (shell . t)
     (sqlite . t)
     (js . t)))

  (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
  (add-to-list 'org-babel-tangle-lang-exts '("js" . "js"))

  (defun my-org-confirm-babel-evaluate (lang body)
    "Do not confirm evaluation for these languages."
    (not (or (string= lang "C")
             (string= lang "ipython")
             (string= lang "java")
             (string= lang "python")
             (string= lang "emacs-lisp")
             (string= lang "js")
             (string= lang "sqlite"))))
  (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)

  ;; js
  (setq org-babel-js-function-wrapper
        "console.log(require('util').inspect(function(){\n%s\n}(), { depth: 100 }))")

  ;;; display/update images in the buffer after I evaluate
  (add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)
#+end_src

#+RESULTS:
| org-display-inline-images |


